УНФ_ТЕСТ/src/Reports/КонтрольЗаполненияКонтактнойИнформации/КонтрольЗаполненияКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>КонтрольЗаполненияКонтактнойИнформации</name>
  <attributes>
    <name>ЭтоОтчетУНФ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Report>

УНФ_ТЕСТ/src/Catalogs/ВидыКонтактнойИнформации/ВидыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыКонтактнойИнформации</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>СправочникВидыДеятельностиЕНВД</name>
      <description>Контактная информация справочника &quot;Виды деятельности ЕНВД&quot;</description>
    </items>
    <items>
      <name>СправочникКонтактныеЛица</name>
      <description>Контактная информация справочника &quot;Контактные лица&quot;</description>
    </items>
    <items>
      <name>СправочникКонтактыЛидов</name>
      <description>Контактная информация справочника &quot;Контакты лидов&quot;</description>
    </items>
    <items>
      <name>СправочникКонтрагенты</name>
      <description>Контактная информация справочника &quot;Контрагенты&quot;</description>
    </items>
    <items>
      <name>СправочникЛиды</name>
      <description>Контактная информация справочника &quot;Лиды&quot;</description>
      </content>
    </items>
    <items>
      <name>СправочникОрганизации</name>
      <description>Контактная информация справочника &quot;Организации&quot;</description>
    </items>
    <items>
      <name>СправочникПользователи</name>
      <description>Контактная информация справочника &quot;Пользователи&quot;</description>
    </items>
    <items>
      <name>СправочникПунктыВыдачиЗаказа</name>
      <description>Контактная информация справочника &quot;Пункты выдачи заказа&quot;</description>
    </items>
    <items>
      <name>СправочникСтруктурныеЕдиницы</name>
      <description>Контактная информация справочника &quot;Структурные единицы&quot;</description>
    </items>
    <items>
      <name>СправочникТорговыеТочки</name>
      <description>Контактная информация справочника &quot;Торговые точки&quot;</description>
    </items>
    <items>
      <name>СправочникФизическиеЛица</name>
      <description>Контактная информация справочника &quot;Физические лица&quot;</description>
    </items>
  </predefined>
  <attributes>
    <name>ТолькоНациональныйАдрес</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРедактирования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидПоляДругое</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьСтрануВПредставление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьРедактированиеПользователем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МожноИзменятьСпособРедактирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательноеЗаполнение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьКорректность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьПоФИАС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьВводНесколькихЗначений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьРедактированиеТолькоВДиалоге</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СкрыватьНеактуальныеАдреса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонCДобавочнымНомером</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыКонтактнойИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьОКТМО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранитьИсториюИзменений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МеждународныйФорматАдреса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПредопределенногоВида</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяГруппы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсправлятьУстаревшиеАдреса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторДляФормул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаскаНомераТелефона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВводитьНомерПоМаске</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Представления</name>
    <attributes>
      <name>КодЯзыка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УНФ_ТЕСТ/src/Reports/КонтрольЗаполненияКонтактнойИнформации/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ПриОпределенииНастроекОтчета(НастройкиОтчета, НастройкиВариантов) Экспорт
	
	УстановитьТегиВариантов(НастройкиВариантов);
	НастройкиВариантов["КонтрольЗаполненияКонтактнойИнформации"].Рекомендуемый = Истина;
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();
	
	НастройкиОтчета.ПараметрыДанных.УстановитьЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ВидКИКонтрагенты"),
		ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.СправочникКонтрагенты"));
	НастройкиОтчета.ПараметрыДанных.УстановитьЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ВидКИКонтактныеЛица"),
		ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.СправочникКонтактныеЛица"));
	
	ОбработатьПараметрВыводитьЗаголовок(НастройкиОтчета);

	УправлениеНебольшойФирмойОтчеты.УстановитьМакетОформленияОтчета(НастройкиОтчета);
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиОтчета, ДанныеРасшифровки);

	// Создадим и инициализируем процессор компоновки
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки, Истина);

	// Создадим и инициализируем процессор вывода результата
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);

	// Обозначим начало вывода
	ПроцессорВывода.НачатьВывод();
	ТаблицаЗафиксирована = Ложь;

	ДокументРезультат.ФиксацияСверху = 0;
	// Основной цикл вывода отчета
	Пока Истина Цикл
		// Получим следующий элемент результата компоновки
		ЭлементРезультата = ПроцессорКомпоновки.Следующий();

		Если ЭлементРезультата = Неопределено Тогда
			// Следующий элемент не получен - заканчиваем цикл вывода
			Прервать;
		Иначе
			// Зафиксируем шапку
			Если  Не ТаблицаЗафиксирована 
				  И ЭлементРезультата.ЗначенияПараметров.Количество() > 0 
				  И ТипЗнч(КомпоновщикНастроек.Настройки.Структура[0]) <> Тип("ДиаграммаКомпоновкиДанных") Тогда

				ТаблицаЗафиксирована = Истина;
				ДокументРезультат.ФиксацияСверху = ДокументРезультат.ВысотаТаблицы;

			КонецЕсли;
			// Элемент получен - выведем его при помощи процессора вывода
			ПроцессорВывода.ВывестиЭлемент(ЭлементРезультата);
		КонецЕсли;
	КонецЦикла;
	
	ПроцессорВывода.ЗакончитьВывод();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбработатьПараметрВыводитьЗаголовок(Знач НастройкиОтчета)
	
	ПараметрВыводитьЗаголовок = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(
		Новый ПараметрКомпоновкиДанных("ВыводитьЗаголовок"));
		
	Если ПараметрВыводитьЗаголовок = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрВывода = НастройкиОтчета.ПараметрыВывода.НайтиЗначениеПараметра(
		Новый ПараметрКомпоновкиДанных("ВыводитьЗаголовок"));
		
	Если ПараметрВыводитьЗаголовок.Значение Тогда
		ПараметрВывода.Значение = ТипВыводаТекстаКомпоновкиДанных.Выводить;
	Иначе
		ПараметрВывода.Значение = ТипВыводаТекстаКомпоновкиДанных.НеВыводить;
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьТегиВариантов(НастройкиВариантов)
	
	НастройкиВариантов["КонтрольЗаполненияКонтактнойИнформации"].Теги = НСтр("ru = 'Ошибки,Контакты,CRM'");
	
КонецПроцедуры

#КонецОбласти 

#Область Инициализация

ЭтоОтчетУНФ = Истина;

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
